# __INCREMENTAL CAPSTONE__
<br>
<br>

## __WEEK 1__

__Task: Import and export data, clean data.__

1. Import relevant python libraries necessary for Python programming and Numpy for doing Numerical operations.
2. Import the CSV file – NSMES1988.csv into a dataframe.
3. Inspect the data and report the details from physical inspection – rows, columns, data types etc.
4. Find out if the data is clean or if the data has missing values.
5. Comment on the data types, their values and their range, specifically on age and income columns.
6. Export the data to JSON as NSMES1988.json format file and view and enter your comments.
7. Perform memory information on the data and recommend what non-default data types you would recommend to optimize memory settings for the dataframe.
8. What changes you would recommend on the dataframe before attempting a detailed data analysis.
9. Export the data frame as a new CSV file NSMES1988new.csv and store it in the local space for possible use in other assignments.
10. Write a short report on the visual observations of the data.

__1. Import relevant python libraries necessary for Python programming and Numpy for doing Numerical operations.__

In [3]:
import numpy as np
import pandas as pd

<br>

__2. Import the CSV file – NSMES1988.csv into a dataframe.__

In [4]:
df = pd.read_csv('../data/NSMES1988.csv')

<br>

__3. Inspect the data and report the details from physical inspection – rows, columns, data types etc.__

In [5]:
df.head()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,1,5,0,0,0,0,1,average,2,normal,other,6.9,male,yes,6,2.8810,yes,yes,no
1,2,1,0,2,0,2,0,average,2,normal,other,7.4,female,yes,10,2.7478,no,yes,no
2,3,13,0,0,0,3,3,poor,4,limited,other,6.6,female,no,10,0.6532,no,no,yes
3,4,16,0,5,0,1,1,poor,2,limited,other,7.6,male,yes,3,0.6588,no,yes,no
4,5,3,0,0,0,0,0,average,2,limited,other,7.9,female,yes,6,0.6588,no,yes,no

In [6]:
df.tail()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
4401,4402,11,0,0,0,0,0,average,0,normal,other,8.4,female,yes,8,2.249700,no,yes,no
4402,4403,12,0,0,0,0,0,average,2,normal,other,7.8,female,no,11,5.813200,no,yes,no
4403,4404,10,0,20,0,1,1,average,5,normal,other,7.3,male,yes,12,3.877916,no,yes,no
4404,4405,16,1,0,0,0,0,average,0,normal,other,6.6,female,yes,12,3.877916,no,yes,no
4405,4406,0,0,0,0,0,0,excellent,0,normal,other,7.1,male,yes,0,6.596800,yes,no,no

In [7]:
df.shape

(4406, 19)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4406 non-null   int64
 1   visits      4406 non-null   int64
 2   nvisits     4406 non-null   int64
 3   ovisits     4406 non-null   int64
 4   novisits    4406 non-null   int64
 5   emergency   4406 non-null   int64
 6   hospital    4406 non-null   int64
 7   health      4406 non-null   object
 8   chronic     4406 non-null   int64
 9   adl         4406 non-null   object
 10  region      4406 non-null   object
 11  age         4406 non-null   float64
 12  gender      4406 non-null   object
 13  married     4406 non-null   object
 14  school      4406 non-null   int64
 15  income      4406 non-null   float64
 16  employed    4406 non-null   object
 17  insurance   4406 non-null   object
 18  medicaid    4406 non-null   object
dtypes: float64(2), int64(9), object(8)
memory usage: 654.1+ KB

In [9]:
df.describe()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,chronic,age,school,income
count,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000
mean,2203.500000,5.774399,1.618021,0.750794,0.536087,0.263504,0.295960,1.541988,7.402406,10.290286,2.527132
std,1272.046972,6.759225,5.317056,3.652759,3.879506,0.703659,0.746398,1.349632,0.633405,3.738736,2.924648
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,6.600000,0.000000,-1.012500
25%,1102.250000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,6.900000,8.000000,0.912150
50%,2203.500000,4.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,7.300000,11.000000,1.698150
75%,3304.750000,8.000000,1.000000,0.000000,0.000000,0.000000,0.000000,2.000000,7.800000,12.000000,3.172850
max,4406.000000,89.000000,104.000000,141.000000,155.000000,12.000000,8.000000,8.000000,10.900000,18.000000,54.835100

In [10]:
df.dtypes

Unnamed: 0      int64
visits          int64
nvisits         int64
ovisits         int64
novisits        int64
emergency       int64
hospital        int64
health         object
chronic         int64
adl            object
region         object
age           float64
gender         object
married        object
school          int64
income        float64
employed       object
insurance      object
medicaid       object
dtype: object

## Drop column "Unnamed: 0"

In [11]:
df.head()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,1,5,0,0,0,0,1,average,2,normal,other,6.9,male,yes,6,2.8810,yes,yes,no
1,2,1,0,2,0,2,0,average,2,normal,other,7.4,female,yes,10,2.7478,no,yes,no
2,3,13,0,0,0,3,3,poor,4,limited,other,6.6,female,no,10,0.6532,no,no,yes
3,4,16,0,5,0,1,1,poor,2,limited,other,7.6,male,yes,3,0.6588,no,yes,no
4,5,3,0,0,0,0,0,average,2,limited,other,7.9,female,yes,6,0.6588,no,yes,no

In [14]:
df.drop(columns=["Unnamed: 0"],inplace=True)
# Or, alternatively, reassign: df = df.drop(columns="Unnamed: 0")

In [15]:
df.head()

,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,5,0,0,0,0,1,average,2,normal,other,6.9,male,yes,6,2.8810,yes,yes,no
1,1,0,2,0,2,0,average,2,normal,other,7.4,female,yes,10,2.7478,no,yes,no
2,13,0,0,0,3,3,poor,4,limited,other,6.6,female,no,10,0.6532,no,no,yes
3,16,0,5,0,1,1,poor,2,limited,other,7.6,male,yes,3,0.6588,no,yes,no
4,3,0,0,0,0,0,average,2,limited,other,7.9,female,yes,6,0.6588,no,yes,no

<br>

__4. Find out if the data is clean or if the data has missing values.__

In [18]:
# Obtain the number of missing values for each column
df.isnull().sum()

visits       0
nvisits      0
ovisits      0
novisits     0
emergency    0
hospital     0
health       0
chronic      0
adl          0
region       0
age          0
gender       0
married      0
school       0
income       0
employed     0
insurance    0
medicaid     0
dtype: int64

In [19]:
# Equivalently, (axis=0 is the default)
# axis=0 means that we sum over the rows, for each columns
# It means that we sum all the values for each column
df.isnull().sum(axis=0)

visits       0
nvisits      0
ovisits      0
novisits     0
emergency    0
hospital     0
health       0
chronic      0
adl          0
region       0
age          0
gender       0
married      0
school       0
income       0
employed     0
insurance    0
medicaid     0
dtype: int64

In [20]:
# Equivalently,
df.isna().sum()

visits       0
nvisits      0
ovisits      0
novisits     0
emergency    0
hospital     0
health       0
chronic      0
adl          0
region       0
age          0
gender       0
married      0
school       0
income       0
employed     0
insurance    0
medicaid     0
dtype: int64

In [21]:
# Remark
null_values_series = df.isna().sum()
null_values_series

visits       0
nvisits      0
ovisits      0
novisits     0
emergency    0
hospital     0
health       0
chronic      0
adl          0
region       0
age          0
gender       0
married      0
school       0
income       0
employed     0
insurance    0
medicaid     0
dtype: int64

In [22]:
type(null_values_series)

pandas.core.series.Series

__Conclusion: there is no missing value.__

In [23]:
# Remark: notna is the contrary of isna
df.notna()

,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4401,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4402,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4403,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4404,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4405,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True

In [24]:
df.notna().sum()

visits       4406
nvisits      4406
ovisits      4406
novisits     4406
emergency    4406
hospital     4406
health       4406
chronic      4406
adl          4406
region       4406
age          4406
gender       4406
married      4406
school       4406
income       4406
employed     4406
insurance    4406
medicaid     4406
dtype: int64

<br>

__5. Comment on the data types, their values and their range, specifically on age and income columns__

In [29]:
df[['age','income']].dtypes

age       float64
income    float64
dtype: object

__Remark: the types of the age and income are ok.__

In [30]:
df.head(2)

,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,5,0,0,0,0,1,average,2,normal,other,6.9,male,yes,6,2.8810,yes,yes,no
1,1,0,2,0,2,0,average,2,normal,other,7.4,female,yes,10,2.7478,no,yes,no

In [26]:
print(df['age'].min(),df['age'].max())

6.6 10.9

In [28]:
print(df['income'].min(),df['income'].max())

-1.0125 54.8351

In [31]:
df[['age','income']].describe()

               age       income
count  4406.000000  4406.000000
mean      7.402406     2.527132
std       0.633405     2.924648
min       6.600000    -1.012500
25%       6.900000     0.912150
50%       7.300000     1.698150
75%       7.800000     3.172850
max      10.900000    54.835100

<br>

__6. Export the data to JSON as NSMES1988.json format file and view and enter your comments.__

In [32]:
df.to_json('NSMES1988.json')

<br>

__7. Perform memory information on the data and recommend what non-default data types you would recommend to optimize memory settings for the dataframe.__

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 18 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   visits     4406 non-null   int64
 1   nvisits    4406 non-null   int64
 2   ovisits    4406 non-null   int64
 3   novisits   4406 non-null   int64
 4   emergency  4406 non-null   int64
 5   hospital   4406 non-null   int64
 6   health     4406 non-null   object
 7   chronic    4406 non-null   int64
 8   adl        4406 non-null   object
 9   region     4406 non-null   object
 10  age        4406 non-null   float64
 11  gender     4406 non-null   object
 12  married    4406 non-null   object
 13  school     4406 non-null   int64
 14  income     4406 non-null   float64
 15  employed   4406 non-null   object
 16  insurance  4406 non-null   object
 17  medicaid   4406 non-null   object
dtypes: float64(2), int64(8), object(8)
memory usage: 619.7+ KB

In [34]:
# More accurate memory estimate
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 18 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   visits     4406 non-null   int64
 1   nvisits    4406 non-null   int64
 2   ovisits    4406 non-null   int64
 3   novisits   4406 non-null   int64
 4   emergency  4406 non-null   int64
 5   hospital   4406 non-null   int64
 6   health     4406 non-null   object
 7   chronic    4406 non-null   int64
 8   adl        4406 non-null   object
 9   region     4406 non-null   object
 10  age        4406 non-null   float64
 11  gender     4406 non-null   object
 12  married    4406 non-null   object
 13  school     4406 non-null   int64
 14  income     4406 non-null   float64
 15  employed   4406 non-null   object
 16  insurance  4406 non-null   object
 17  medicaid   4406 non-null   object
dtypes: float64(2), int64(8), object(8)
memory usage: 2.4 MB

<br>

__8. What changes you would recommend on the dataframe before attempting a detailed data analysis.__

In [49]:
# Let's analyze the integers; create a dataframe that contains only the integer features
df2 = df[['visits','nvisits','ovisits','novisits','emergency','hospital','chronic','school']]
df2.head()

   visits  nvisits  ovisits  novisits  emergency  hospital  chronic  school
0       5        0        0         0          0         1        2       6
1       1        0        2         0          2         0        2      10
2      13        0        0         0          3         3        4      10
3      16        0        5         0          1         1        2       3
4       3        0        0         0          0         0        2       6

In [50]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   visits     4406 non-null   int64
 1   nvisits    4406 non-null   int64
 2   ovisits    4406 non-null   int64
 3   novisits   4406 non-null   int64
 4   emergency  4406 non-null   int64
 5   hospital   4406 non-null   int64
 6   chronic    4406 non-null   int64
 7   school     4406 non-null   int64
dtypes: int64(8)
memory usage: 275.5 KB

In [51]:
df2.max()

visits        89
nvisits      104
ovisits      141
novisits     155
emergency     12
hospital       8
chronic        8
school        18
dtype: int64

In [52]:
df2 = df2.astype('int16')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   visits     4406 non-null   int16
 1   nvisits    4406 non-null   int16
 2   ovisits    4406 non-null   int16
 3   novisits   4406 non-null   int16
 4   emergency  4406 non-null   int16
 5   hospital   4406 non-null   int16
 6   chronic    4406 non-null   int16
 7   school     4406 non-null   int16
dtypes: int16(8)
memory usage: 69.0 KB

In [53]:
df2.max()

visits        89
nvisits      104
ovisits      141
novisits     155
emergency     12
hospital       8
chronic        8
school        18
dtype: int16

__The maximum values for the integers has not changed. We did not lose any information when converting from 64 bits to 16 bits.__

In [54]:
# Let's analyze some "float" features
df3 = df[['age','income']]
df3.head()

   age  income
0  6.9  2.8810
1  7.4  2.7478
2  6.6  0.6532
3  7.6  0.6588
4  7.9  0.6588

In [56]:
df3.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4406 non-null   float64
 1   income  4406 non-null   float64
dtypes: float64(2)
memory usage: 69.0 KB

In [58]:
df3.astype('float32').head()

   age  income
0  6.9  2.8810
1  7.4  2.7478
2  6.6  0.6532
3  7.6  0.6588
4  7.9  0.6588

In [59]:
df3.astype('float32').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4406 non-null   float32
 1   income  4406 non-null   float32
dtypes: float32(2)
memory usage: 34.5 KB

__The values for the floats have not changed when converting from 64 bits to 32 bits. We did not lose any information when converting from 64 bits to 16 bits.__

## Conclusion:
## To save memory, we recommend changing all the int64 to int16 and change from float64 to float32 for age and income.
<br>

<br>

__9. Export the data frame as a new CSV file NSMES1988new.csv and store it in the local space for possible use in other assignments.__

In [62]:
df.to_csv('NSMES1988new.csv',index=False)

In [63]:
df1= pd.read_csv('NSMES1988new.csv')
df1.head()

,visits,nvisits,ovisits,novisits,emergency,hospital,health,chronic,adl,region,age,gender,married,school,income,employed,insurance,medicaid
0,5,0,0,0,0,1,average,2,normal,other,6.9,male,yes,6,2.8810,yes,yes,no
1,1,0,2,0,2,0,average,2,normal,other,7.4,female,yes,10,2.7478,no,yes,no
2,13,0,0,0,3,3,poor,4,limited,other,6.6,female,no,10,0.6532,no,no,yes
3,16,0,5,0,1,1,poor,2,limited,other,7.6,male,yes,3,0.6588,no,yes,no
4,3,0,0,0,0,0,average,2,limited,other,7.9,female,yes,6,0.6588,no,yes,no

<br>

__10. Write a short report on the visual observations of the data.__

In this exercise, we did a top-level data analysis, after reading the provided CSV file. After the inspection of the data, we understood that there are many int64 columns that could have been int8, as the range demands that. Similarly, two float columns, which could have been just float16.
We also had a deep look at two columns age and income and analysed.
Also, we exported the CSV to JSON format and wrote it locally as a JSON file, and visually analysed it.

<br>

## __WEEK 2__

__Task: Perform linear algebraic operations.__

 
1. Import relevant python libraries.
2. Import the CSV file – NSMES1988new.csv into a dataframe, and enforce the dtypes recommended in step 9 of Week 1.
3. Perform memory analysis of the new dataframe and compare it with the memory of the dataframe in the previous week and mark your comments.
4. Perform the following operations on age and income columns. Multiply Age by 10 and income by 10000. 
5. Perform basic statistical analysis on the new dataframe and generate a brief report on the outcome. Save the dataframe as NSMES1988updated.csv file in the local space for possible future use.
6. Invoke describe command on the dataframe and compare that with the basic statistics analysis done in the previous step, and report.
7. Indicate which of the columns are not eligible for statistical analysis and indicate possible datatype changes, and report. 
8. Make changes to the recommended in the previous step, export it as a new .csv file for possible future use (Optional).
9. Prepare a brief report and enter it in the mark-up cells of JupyterLab Notebook.

<br>

__1. Import relevant python libraries.__

In [38]:
import numpy as np
import pandas as pd

<br>

__2. Import the CSV file – NSMES1988new.csv into a dataframe, and enforce the dtypes recommended in step 9 of Week 1.__

In [39]:
df = pd.read_csv('../data/NSMES1988.csv')

In [40]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4406 non-null   int64
 1   visits      4406 non-null   int64
 2   nvisits     4406 non-null   int64
 3   ovisits     4406 non-null   int64
 4   novisits    4406 non-null   int64
 5   emergency   4406 non-null   int64
 6   hospital    4406 non-null   int64
 7   health      4406 non-null   object
 8   chronic     4406 non-null   int64
 9   adl         4406 non-null   object
 10  region      4406 non-null   object
 11  age         4406 non-null   float64
 12  gender      4406 non-null   object
 13  married     4406 non-null   object
 14  school      4406 non-null   int64
 15  income      4406 non-null   float64
 16  employed    4406 non-null   object
 17  insurance   4406 non-null   object
 18  medicaid    4406 non-null   object
dtypes: float64(2), int64(9), object(8)
memory usage: 2.2 MB

In [41]:
df_save=df

In [42]:
df = df.select_dtypes(include=['float64', 'int64'])
float_columns = df.select_dtypes(include=['float64']).columns
int_columns = df.select_dtypes(include=['int64']).columns
df[int_columns] = df[int_columns].astype('int16')
df[float_columns] = df[float_columns].astype('float32')
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4406 non-null   int16
 1   visits      4406 non-null   int16
 2   nvisits     4406 non-null   int16
 3   ovisits     4406 non-null   int16
 4   novisits    4406 non-null   int16
 5   emergency   4406 non-null   int16
 6   hospital    4406 non-null   int16
 7   chronic     4406 non-null   int16
 8   age         4406 non-null   float32
 9   school      4406 non-null   int16
 10  income      4406 non-null   float32
dtypes: float32(2), int16(9)
memory usage: 112.0 KB

<br>

__3. Perform memory analysis of the new dataframe and compare it with the memory of the dataframe in the previous week and mark your comments.__

In [43]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4406 entries, 0 to 4405
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4406 non-null   int16
 1   visits      4406 non-null   int16
 2   nvisits     4406 non-null   int16
 3   ovisits     4406 non-null   int16
 4   novisits    4406 non-null   int16
 5   emergency   4406 non-null   int16
 6   hospital    4406 non-null   int16
 7   chronic     4406 non-null   int16
 8   age         4406 non-null   float32
 9   school      4406 non-null   int16
 10  income      4406 non-null   float32
dtypes: float32(2), int16(9)
memory usage: 112.0 KB

<br>

__4. Perform the following operations on age and income columns. Multiply Age by 10 and income by 10000.__

In [44]:
df["age"] = df["age"] * 10
df["income"] = df["income"] * 10_000
df.head()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,chronic,age,school,income
0,1,5,0,0,0,0,1,2,69.0,6,28810.000000
1,2,1,0,2,0,2,0,2,74.0,10,27478.001953
2,3,13,0,0,0,3,3,4,66.0,10,6531.999512
3,4,16,0,5,0,1,1,2,76.0,3,6588.000000
4,5,3,0,0,0,0,0,2,79.0,6,6588.000000

<br>

__5. Perform basic statistical analysis on the new dataframe and generate a brief report on the outcome. Save the dataframe as NSMES1988updated.csv file in the local space for possible future use.__

In [45]:
df.describe()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,chronic,age,school,income
count,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000
mean,2203.500000,5.774399,1.618021,0.750794,0.536087,0.263504,0.295960,1.541988,74.024055,10.290286,25271.320312
std,1272.046972,6.759225,5.317056,3.652759,3.879506,0.703659,0.746398,1.349632,6.334050,3.738736,29246.476562
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,66.000000,0.000000,-10125.000000
25%,1102.250000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,69.000000,8.000000,9121.500000
50%,2203.500000,4.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,73.000000,11.000000,16981.500000
75%,3304.750000,8.000000,1.000000,0.000000,0.000000,0.000000,0.000000,2.000000,78.000000,12.000000,31728.500000
max,4406.000000,89.000000,104.000000,141.000000,155.000000,12.000000,8.000000,8.000000,109.000000,18.000000,548351.000000

In [46]:
df.max()

Unnamed: 0      4406.0
visits            89.0
nvisits          104.0
ovisits          141.0
novisits         155.0
emergency         12.0
hospital           8.0
chronic            8.0
age              109.0
school            18.0
income        548351.0
dtype: float32

In [47]:
df.to_csv('../data/NSMES1988_2.csv', index=False)

In [48]:
test_df = pd.read_csv('../data/NSMES1988_2.csv')
test_df.head()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,chronic,age,school,income
0,1,5,0,0,0,0,1,2,69.0,6,28810.0000
1,2,1,0,2,0,2,0,2,74.0,10,27478.0020
2,3,13,0,0,0,3,3,4,66.0,10,6531.9995
3,4,16,0,5,0,1,1,2,76.0,3,6588.0000
4,5,3,0,0,0,0,0,2,79.0,6,6588.0000

In [49]:
test_df.describe()

,Unnamed: 0,visits,nvisits,ovisits,novisits,emergency,hospital,chronic,age,school,income
count,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000,4406.000000
mean,2203.500000,5.774399,1.618021,0.750794,0.536087,0.263504,0.295960,1.541988,74.024058,10.290286,25271.320501
std,1272.046972,6.759225,5.317056,3.652759,3.879506,0.703659,0.746398,1.349632,6.334050,3.738736,29246.476319
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,66.000000,0.000000,-10125.000000
25%,1102.250000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,69.000000,8.000000,9121.500000
50%,2203.500000,4.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,73.000000,11.000000,16981.500000
75%,3304.750000,8.000000,1.000000,0.000000,0.000000,0.000000,0.000000,2.000000,78.000000,12.000000,31728.500000
max,4406.000000,89.000000,104.000000,141.000000,155.000000,12.000000,8.000000,8.000000,109.000000,18.000000,548351.000000

In [ ]:
df1= pd.read_csv('NSMES1988new2.csv')
df1.head()

<br>

__6. Invoke describe command on the dataframe and compare that with the basic statistics analysis done in the previous step, and report.__

In [ ]:
df.describe()

<br>

__7. Indicate which of the columns are not eligible for statistical analysis and indicate possible datatype changes, and report.__

Unnamed: 0: removed it during week 1
Convert int32 => int16 and float64 to float32

<br>

__8. Make changes to the recommended in the previous step, export it as a new .csv file for possible future use (Optional).__

<br>

__9. Prepare a brief report and enter it in the mark-up cells of JupyterLab Notebook.__

From the above analysis, we have been able to determine the following. There are totally 20 columns and 40406 rows of data. Of the 20 columns, we need to ignore column named 'Unnamed: 0', as it just represents row numbers. As a part of the given task, we did the memory optimization of the dataset, and could see substantial optimization can be done, provided we could fix the dtypes, based on the range.
Further, we did two math operations, one on column called age, and the other one on the column called income. We multiplied age by 10 and income by 10,000, as the given dataset, previously had that factor included.
Next, we performed basic statistics operation on the relevant numerical columns and obtained the basic statistics, and compared them with the values obtained from describe() function. We then saved the new dataframe with updated values for next set of tasks.